sdaiValidateReferenceDomain(Sdai_instS*,Sdai_instS*,Sdai_Id_aggr*)
\details
Checks whether all the attributes in the specified application instance with a reference to an entity instance refer to entity instance from SDAI-models in the schema instance.
\param schemaInstance [in] A schema instance.
\param appInstance    [in] An application instance object.
\param list           [out] An identifier of a pre-existing NPL that stores the list of attributes that do not conform to the validation.
\returns
* sdaiTRUE if the constraint is satisfied.
* sdaiFALSE if the constraint is violated.
* sdaiUNKNOWN if the constraint is not defined or can not be evaluated for any reason (an EXPRESS error, incorrectly filled data, mandatory data is unset, etc.).